{
  "metadata": "Portfolio of",

  "form-error-1":"Email not exist",
  "form-send": "Sent",
  "form-input-name":"Name",
  "form-input-email":"Email",
  "form-input-message":"Message",
  "form-button-text": "Send",
  "form-validate-required":"Required",
  "form-validate-email":"Email not valid",
  "form-validate-minCharacters":"Minimum 10 characters",
  "form-validate-maxCharacters":"Maximum 500 characters",
  
  "loading": "Welcome to my Portfolio",
  "404": "Page not found",
  "back": "Back",

  "aboutme-greeting": "Hello! I'm Agustín",
  "aboutme-greeting2": "From concept to code.",
  "aboutme-greeting3": " Full Stack Developer, ",
  "aboutme-greeting4": "passionate about innovation.",
  "aboutme-talk": "Let's Talk",

  "details-title":"Details",
  "project-title": "Projects",
  "technologys": "Technologys",
  "libraries": "Libraries",
  "year": "Year",
  "client": "Client",
  "repo-web": "Repo & Web",

  "prev-button": "Prev",
  "next-button": "Next",

  "own-project": "Own",
  "client-project": "Client",

  "galery-title": "Galery",

  "contact-title": "Contact Me",
  "contact-message": "My goal is to build a unique and exciting web experience for your users. I'm ready to create a product that will improve the lives of your customers. Let's talk about how we can do it together!",

  "footer":"Developed by AguzzDev",

  "overview-title":"Overview",
  "overview-title2":"Features",

  "overview-paint-description":"Paint App is an application that I have developed integrating the react-canvas-draw package. Inspired by the well-known Paint interface, this application offers a series of functionalities that allow users to express their creativity in digital way.",
  "overview-paint-features": "Pencil and Eraser: The app includes a stylus for drawing freely, as well as an eraser for correcting or adjusting strokes../Adjustable Pen Width: Users have the ability to customize the thickness of the pencil, allowing them to create thin or thick lines depending on their artistic preferences../Color Palette: A color palette has been incorporated that offers a wide range of options to choose from. This allows users to bring life to your creations with a variety of tones../Undo Feature: The app provides an undo feature that allows users to reverse previous actions, giving them the flexibility to experiment without worries../Clear All: For a quick cleanup, the Paint App features an option to clear the entire canvas, providing a blank canvas with a single click.",

  "overview-memories-description":"Memories App is an application developed with the MERN stack (MongoDB, Express.js, React and Node.js) designed for interactive memory creation. This application provides various functionalities that allow users to manage their notes efficiently.",
  "overview-memories-features":"Creating, Updating and Deleting Notes: The application allows users to create, update and delete notes, giving them full control over their content../Inclusion of Tags: Users have the ability to organize your notes by including tags, making it easier to categorize and search for specific content../Like Function: The application incorporates a Like function that allows users to express their appreciation for specific notes, encouraging interaction and positive feedback../Pagination: For a smoother user experience, the Memories App includes pagination functionality, making it easy to navigate between different sets of notes../Search: With the search function, users can quickly find specific notes, improving accessibility and efficiency in managing your memories../Inclusion of Images: In addition to text, the application allows users to enrich their notes by including images, adding a visual component to their memories.",

  "overview-google-description":"Google Clone is an application that replicates the Google user interface and allows users to perform searches using the Google API. This application offers a familiar experience similar to the Google home page , but with the ability to interact with Google's powerful search API.",
  "overview-google-features":"Google-Like User Interface: The Google Clone features a user interface that mimics the familiar look and feel of Google, giving users a familiar and easy-to-use search experience../Search Using Google API: The application uses the Google API to perform web searches, providing accurate and up-to-date search results directly from the Google search engine../Dynamic Search Results: Search results are presented in a dynamic, displaying relevant information and suggestions as the user types in the search bar, similar to Google's functionality../Access to Different Types of Content: In addition to standard web searches, the Google Clone can offer access to different types of content. content provided by the Google API, such as images, news, videos, among others../Links to External Results: When clicking on the search results, users are redirected to the corresponding external pages, allowing them to access the complete information directly from the application.",

  "overview-elementor-description":"Elementor Clone is a page designed with the purpose of replicating the landing page of Elementor, a popular page building tool for WordPress. This application provides a practice environment where users can experiment with the creation of layouts and designs similar to those offered by Elementor.",
  "overview-elementor-features":"Replica of the Elementor Landing Page: The Elementor Clone reproduces the structure and visual design of the official Elementor landing page, providing a practical environment for the recreation of complex layouts../Menu Dropdown Navigation: The page includes a navigation menu with dropdown functionality, allowing users to practice creating and designing interactive and efficient menus../Responsive Design: Emphasis is placed on the practice of responsive design, allowing users to experiment with the layout adapting to different screen sizes, from mobile devices to desktop screens../Menu Interactivity: The drop-down menu can be designed to include smooth transitions and visual effects, giving users the opportunity to explore and practice techniques advanced user interface design.",
  
  "overview-frontendcafe-description":"FrontendCafe Clone is a page designed with the purpose of replicating all sections of the FrontendCafe page. This project focuses on the practice of creating layouts and provides users with the opportunity to experiment with the structure and visual design of the original FrontendCafe page.",
  "overview-frontendcafe-features":"Faithful Replica of FrontendCafe Sections: The FrontendCafe Clone accurately reproduces all the sections present on the original FrontendCafe page, from the home section to the blog sections, events, and any other relevant area../Detailed Design Practice: Users have the opportunity to practice creating complex and detailed layouts, as well as understand the specific techniques used in each section of FrontendCafe../Interactivity and Dynamic Elements: Interactive elements are included and dynamics present on the original page, allowing users to practice implementing advanced components and specific functionalities../Responsive Adaptation: The page replicates the responsive adaptation of FrontendCafe, allowing users to practice creating layouts that fit correctly. efficient to different devices and screen sizes../Style and Typography: Special attention is paid to the precise replication of the visual style and typography used in FrontendCafe, giving users the opportunity to hone their skills in selecting and applying styles coherent visuals.",

  "overview-udemy-description":"Udemy Clone is a practice project in which I have created a page inspired by the landing page of Udemy, an online educational platform. The main objective of this project is to improve my skills in creating of layouts, web design and layout, taking as reference an existing website.",
  "overview-udemy-features":"Udemy-Like Design:The page replicates the structure and visual design of the Udemy landing page, incorporating elements such as category sections, highlights, and testimonials to recreate the user experience../Design Responsive: A responsive design has been implemented to ensure that the page is accessible and functional on different devices, from desktop to mobile devices../ Colors and Visual Elements: Udemy-like colors and visual elements have been used to achieve consistency with the brand and offer a familiar visual experience to users.",

  "overview-crunchyroll-description":"Crunchyroll Clone is a project in which I am replicating the page layout of Crunchyroll, a popular anime streaming platform. To achieve this, I am using the Jikan API to get information about animes and Markdown (with MDX) to manage the news section",
  "overview-crunchyroll-features":"Crunchyroll Layout Replication:The app will mimic the look and visual structure of the Crunchyroll page to provide a familiar experience to users../Jikan API Integration:I use the Jikan API to obtain data about animes, which allows displaying a list of animes, detailed information and also selecting a random anime../Anime Search:I implement a search engine that allows users to search for specific animes, making it easier to explore and select content../Random Anime:I incorporate the functionality of showing a random anime, providing users with the option to discover new titles randomly../News Section with Markdown (MDX):The news section uses Markdown (with MDX) to present information in a formatted and stylized manner.",

  "overview-disney-description":"The Disney Clone is a project where I am using GraphCMS to manage movie information, replicating the look and feel of the Disney platform. This project incorporates key functionalities such as a list of movies, a search engine, details of the film and the ability to view the associated trailer.",
  "overview-disney-features":"Integration with GraphCMS:I use GraphCMS to create and manage information related to movies, including details such as titles, descriptions, and links to trailers../Movie List:The application displays a list of movies available, allowing users to browse and select titles efficiently../Movie Search:I implement a search engine that allows users to search for specific movies, making it easier to search and select content../Movie Detail:When users Select a movie, the app displays detailed details such as synopsis, rating, and any additional relevant information../Trailer Viewing: I provide the ability to view the movie trailer directly from the app, enhancing the user experience and offering a multimedia preview.",

  "overview-netflix-description":"Netflix Clone is a project where I am using TMDB (The Movie Database) API to create an application that imitates the look and feel of Netflix. This project includes key functionalities such as viewing movies by categories, a search engine and see the details of each movie.",
  "overview-netflix-features":"Integration with TMDB API:I use the TMDB API to get information about movies, including details like titles, descriptions, images, and categories../Movies by Categories:The app organizes movies by categories, allowing users to explore and select specific content based on genres or themes../Movie Search:I implement a search engine that allows users to search for movies by title, facilitating the search and selection of content quickly../Description Movie:When users select a movie, the app displays a detailed description that includes synopsis, rating, cast, and any other relevant information.",

  "overview-planet-description":"EarthJS Planet is a project where I am using Three.js to incorporate a textured sphere of the Earth, thus creating a three-dimensional representation of the planet. This project includes the drop coordinate functionality to create specific points on the earth's surface.",
  "overview-planet-features":"Three-Dimensional Rendering of the Earth:I use Three.js to render a textured sphere of the Earth, providing a realistic three-dimensional visualization of the planet../Coordinate Embedding:I implement functionality that allows Users enter geographic coordinates (latitude and longitude) to place specific points on the Earth's surface../Points on the Earth's Surface: Each time users enter coordinates, the application places a point on the sphere that represents the corresponding location on Earth ../Interactivity:I offer an interactive experience that allows users to explore the sphere, place various points and see how these are distributed on the surface of the planet.",

  "overview-dashboard-description":"Dashboard App is a dashboard app where I am using Recharts and React Table to create multiple tables and charts. This app includes key functionalities like the ability to insert and modify tables, interact with charts generated, and a dark mode for a varied viewing experience.",
  "overview-dashboard-features":"Using Recharts and React Table:I implement Recharts for creating charts and React Table for managing tables, allowing efficient integration of visual and tabular data../Dynamic Tables:I offer the functionality to insert and modify tables, allowing users to customize and organize information according to their needs../Interactive Charts: Charts generated with Recharts are interactive, allowing users to explore specific data and obtain additional details by interacting with the elements of the chart../Dark Mode:I include a dark mode that users can activate to change the visual appearance of the application, providing an additional aesthetic option../Reactive State Management:I use a reactive state to ensure that any changes to the tables or graphics are immediately reflected in the user interface.",

  "overview-ecommerce-description":"Ecommerce App is an ecommerce page built using the MERN stack (MongoDB, Express.js, React, Node.js), and integrating the MercadoPago SDK. This application covers a variety of functionalities essential for an online shopping experience, such as user creation, product viewing by category and filtering, detailed product view, cart and favorites management, test payments with MercadoPago and a purchase history.",
  "overview-ecommerce-features":"Stack MERN:I use MongoDB for the database, Express.js for the backend, React for the frontend, and Node.js for the server../User Authentication:I implement the creation of users to allow personalized access and management of purchase histories../Product Viewing: Users can view all available products, filter by category, and explore purchasing options../Cart and Favorites:Include functionality add products to the cart and favorites list, providing a personalized shopping experience../Integration with MercadoPago:I use the MercadoPago SDK to facilitate secure and efficient payments, allowing users to make test payments../Purchase History: Users can review their purchase history, including details of purchased products, dates and transaction statuses.",

  "overview-twitter-description":"Twitter App is a social application built with the MERN stack (MongoDB, Express.js, React, Node.js) that allows CRUD (Create, Read, Update, Delete) operations. This application incorporates key functionalities of a social network, such as creating users, publishing tweets, uploading images through Cloudinary, interacting with posts through likes and replies, and a Trends (TTs) section.",
  "overview-twitter-features":"Stack MERN:I use MongoDB for the database, Express.js for the backend, React for the frontend, and Node.js for the server../User Authentication:I implement the creation of users to personalize the experience and allow social interactions../Creating Tweets:Users can create text posts, which can also include images uploaded through Cloudinary../Uploading Images with Cloudinary:I use Cloudinary to allow users to upload images and associate them with their tweets../Social Interaction:I include the functionality of liking tweets and responding to posts, encouraging interaction between users../Trends Section (TTs):I show a trends section that reflects the most popular topics. popular and discussed on the platform.",

  "overview-discord-description":"Discord App is a practice project where I am replicating the landing page of Discord, a popular online communication platform. The landing page includes both the main view and the specific view of the Discord app. ",
  "overview-discord-features":"Discord-Inspired Interface:The landing page is designed to replicate the distinctive aesthetic and visual style of the Discord app, providing visitors with a familiar experience../Presentation Section:The main page presents an overview of the Discord Clone project, highlighting its key features and functionalities../Application View:I include a specific section that simulates the Discord app interface, allowing visitors to visualize how the app would look and feel../Interactive Elements: I add interactive elements, such as buttons and links, to provide a more dynamic user experience and allow visitors to explore different sections of the landing page.",

  "overview-sports-description":"Sports App is a football information application focused on the 5 main leagues, where all the information is obtained through scrapping techniques from the Transfermarkt website. In addition, it includes two mini-games, Higher or Lower and World Cup 2022 Prediction. Key features focus on providing detailed league statistics, including fixtures and standings, as well as club, player and match-specific information.",
  "overview-sports-features":"Transfermarkt Scrapping:The app uses scrapping techniques to obtain real-time data from Transfermarkt, ensuring that the information is always up-to-date and accurate../Top 5 League Statistics:Provides detailed statistics , schedules and positions of the 5 main football leagues, offering users a complete view of the teams' performance../Club Information: Provides detailed statistics for each club, including league positions, match schedule and roster of players../Calendar and Positions:Allows users to access the full league calendar and see positions updated in real time../Interactive Minigames:Includes two minigames, Higher or Lower and World Cup 2022 Prediction, to add a entertainment and user participation layer.",

  "overview-whatsapp-description":"WhatsApp Clone is a real-time messaging application that uses GraphQL Subscriptions to facilitate instant communication. The application includes essential functions of messaging, user creation, group creation, profile and group customization , as well as the ability to send GIFs.",
  "overview-whatsapp-features":"GraphQL Subscriptions:I use GraphQL Subscriptions to enable real-time communication, ensuring that messages and updates are delivered instantly../User Creation:Users can register and create custom profiles, including the ability to set your username and add a profile picture../Groups Creation: Allows users to create chat groups, adding members and setting group-specific settings../Profiles and Groups Customization: Offers the option to change the user's name and background image, as well as the ability to customize group information../Administrator Permissions in Groups: Allows granting administrator permissions to specific users within a group, providing greater control over the group management../Sending GIFs:Includes the ability to send GIFs in messages, expanding the options for expression and visual communication."
}
