{
  "metadata": "Portafolio de",

  "form-error-1":"Email no existe",
  "form-send": "Enviado",
  "form-input-name":"Nombre",
  "form-input-email":"Email",
  "form-input-message":"Mensaje",
  "form-button-text": "Enviar",
  "form-validate-required":"Requerido",
  "form-validate-email":"Email no valido",
  "form-validate-minCharacters":"Maximo 10 caracteres",
  "form-validate-maxCharacters":"Minimo 500 caracteres",

  "loading": "Bienvenido a mi Portafolio",
  "404": "Pagina no encontrada",
  "back": "Volver",

  "aboutme-greeting": "Hola, soy Agustín",
  "aboutme-greeting2": "Del concepto al código.",
  "aboutme-greeting3": " Desarrollador Full Stack, ",
  "aboutme-greeting4": "apasionado por la innovación",
  "aboutme-talk": "Hablemos",

  "details-title":"Detalle",
  "project-title": "Proyectos",
  "technologys": "Tecnologias",
  "libraries": "Librerias",
  "year": "Año",
  "client": "Cliente",
  "repo-web": "Repo & Web",

  "prev-button":"Anterior",
  "next-button":"Siguiente",

  "own-project": "Propio",
  "client-project": "Cliente",

  "galery-title":"Galeria",

  "contact-title": "Contactame",
  "contact-message": "Mi meta es construir una experiencia web única y emocionante para tus usuarios. Estoy listo para crear un producto que mejore la vida de tus clientes. ¡Hablemos de cómo podemos lograrlo juntos!",

  "footer":"Desarrollado por AguzzDev",

  "overview-title":"Vision general",
  "overview-title2":"Funcionalidades",

  "overview-paint-description":"Paint App es una aplicación que he desarrollado integrando el paquete react-canvas-draw. Inspirada en la conocida interfaz de Paint, esta aplicación ofrece una serie de funcionalidades que permiten a los usuarios expresar su creatividad de manera digital.",
  "overview-paint-features": "Lápiz y Goma de Borrar: La aplicación incluye un lápiz para dibujar libremente, así como una goma de borrar para corregir o ajustar trazos../Ancho del Lápiz Ajustable: Los usuarios tienen la capacidad de personalizar el grosor del lápiz, lo que les permite crear líneas finas o gruesas según sus preferencias artísticas../Paleta de Colores: Se ha incorporado una paleta de colores que ofrece una amplia gama de opciones para elegir. Esto permite a los usuarios dar vida a sus creaciones con una variedad de tonos../Función de Deshacer: La aplicación proporciona una función de deshacer que permite a los usuarios revertir acciones previas, brindándoles la flexibilidad de experimentar sin preocupaciones../Borrar Todo: Para una limpieza rápida, la Paint App cuenta con una opción para borrar todo el lienzo, proporcionando un lienzo en blanco con un solo clic.",

  "overview-memories-description":"Memories App es una aplicación desarrollada con la pila MERN (MongoDB, Express.js, React y Node.js) diseñada para la creación de memorias de manera interactiva. Esta aplicación proporciona diversas funcionalidades que permiten a los usuarios gestionar sus notas de manera eficiente.",
  "overview-memories-features":"Creación, Actualización y Borrado de Notas: La aplicación permite a los usuarios crear, actualizar y borrar notas, brindándoles control total sobre su contenido../Inclusión de Tags: Los usuarios tienen la capacidad de organizar sus notas mediante la inclusión de tags, facilitando la categorización y búsqueda de contenido específico../Función de Like: La aplicación incorpora una función de Me Gusta que permite a los usuarios expresar su aprecio por notas específicas, fomentando la interacción y retroalimentación positiva../Paginación: Para una experiencia de usuario más fluida, la Memories App incluye funcionalidad de paginación, facilitando la navegación entre diferentes conjuntos de notas../Búsqueda: Con la función de búsqueda, los usuarios pueden encontrar rápidamente notas específicas, mejorando la accesibilidad y eficiencia en la gestión de sus recuerdos../Inclusión de Imágenes: Además de texto, la aplicación permite a los usuarios enriquecer sus notas mediante la inclusión de imágenes, agregando un componente visual a sus recuerdos.",

  "overview-google-description":"Google Clone es una aplicación que replica la interfaz de usuario de Google y permite a los usuarios realizar búsquedas utilizando la API de Google. Esta aplicación ofrece una experiencia familiar similar a la página de inicio de Google, pero con la capacidad de interactuar con la potente API de búsqueda de Google.",
  "overview-google-features":"Interfaz de Usuario Similar a Google: El Google Clone presenta una interfaz de usuario que imita la conocida apariencia de Google, brindando a los usuarios una experiencia de búsqueda familiar y fácil de usar../Búsqueda Utilizando la API de Google: La aplicación utiliza la API de Google para realizar búsquedas en la web, proporcionando resultados de búsqueda precisos y actualizados directamente desde el motor de búsqueda de Google../Resultados de Búsqueda Dinámicos: Los resultados de búsqueda se presentan de manera dinámica, mostrando información relevante y sugerencias mientras el usuario escribe en la barra de búsqueda, similar a la funcionalidad de Google../Acceso a Diferentes Tipos de Contenido: Además de las búsquedas web estándar, el Google Clone puede ofrecer acceso a diferentes tipos de contenido proporcionados por la API de Google, como imágenes, noticias, videos, entre otros../Enlaces a Resultados Externos: Al hacer clic en los resultados de búsqueda, los usuarios son redirigidos a las páginas externas correspondientes, permitiéndoles acceder a la información completa directamente desde la aplicación.",

  "overview-elementor-description":"Elementor Clone es una página diseñada con el propósito de replicar la landing page de Elementor, una conocida herramienta de construcción de páginas para WordPress. Esta aplicación proporciona un entorno de práctica donde los usuarios pueden experimentar con la creación de layouts y diseños similares a los ofrecidos por Elementor.",
  "overview-elementor-features":"Réplica de la Landing Page de Elementor: La Elementor Clone reproduce la estructura y el diseño visual de la landing page oficial de Elementor, proporcionando un entorno práctico para la recreación de layouts complejos../Menú de Navegación Desplegable: La página incluye un menú de navegación con funcionalidad desplegable, permitiendo a los usuarios practicar la creación y el diseño de menús interactivos y eficientes../Diseño Responsivo: Se hace hincapié en la práctica del diseño responsivo, permitiendo a los usuarios experimentar con la adaptación del diseño a diferentes tamaños de pantalla, desde dispositivos móviles hasta pantallas de escritorio../Interactividad del Menú: El menú desplegable puede estar diseñado para incluir transiciones suaves y efectos visuales, brindando a los usuarios la oportunidad de explorar y practicar técnicas avanzadas de diseño de interfaz de usuario.",

  "overview-frontendcafe-description":"FrontendCafe Clone es una página diseñada con el propósito de replicar todas las secciones de la página FrontendCafe. Este proyecto se centra en la práctica de la creación de layouts y proporciona a los usuarios la oportunidad de experimentar con la estructura y el diseño visual de la página original de FrontendCafe.",
  "overview-frontendcafe-features":"Réplica Fiel de las Secciones de FrontendCafe: El FrontendCafe Clone reproduce con precisión todas las secciones presentes en la página original de FrontendCafe, desde la sección de inicio hasta las secciones de blog, eventos, y cualquier otra área relevante../Práctica Detallada de Diseño: Los usuarios tienen la posibilidad de practicar la creación de layouts complejos y detallados, así como de entender las técnicas específicas utilizadas en cada sección de FrontendCafe../Interactividad y Elementos Dinámicos: Se incluyen elementos interactivos y dinámicos presentes en la página original, permitiendo a los usuarios practicar la implementación de componentes avanzados y funcionalidades específicas../Adaptación Responsiva: La página replica la adaptación responsiva de FrontendCafe, permitiendo a los usuarios practicar la creación de diseños que se ajusten de manera eficiente a diferentes dispositivos y tamaños de pantalla../Estilo y Tipografía: Se presta especial atención a la replicación precisa del estilo visual y la tipografía utilizados en FrontendCafe, brindando a los usuarios la oportunidad de perfeccionar sus habilidades en la selección y aplicación de estilos visuales coherentes.",

  "overview-journal-description":"Journal App es una aplicación de notas que opera con las funcionalidades básicas CRUD (Crear, Leer, Actualizar, Borrar) y utiliza Firebase como plataforma para almacenar y gestionar datos. Además, integra Cloudinary para facilitar la carga y gestión de imágenes asociadas a las notas.",
  "overview-journal-features":"Creación y Edición de Notas: Los usuarios pueden crear nuevas notas, proporcionando contenido detallado y texto descriptivo. La aplicación permite también la edición de notas existentes para mantener la información actualizada../Almacenamiento en Firebase: Todas las notas se almacenan y gestionan en Firebase, lo que garantiza un almacenamiento seguro y escalable de la información del usuario../Gestión de Imágenes con Cloudinary: La Journal App permite a los usuarios adjuntar imágenes a sus notas, utilizando Cloudinary para almacenar y gestionar eficientemente los archivos multimedia asociados../  Operaciones CRUD: La aplicación facilita la funcionalidad CRUD completa, permitiendo a los usuarios realizar operaciones como crear, leer, actualizar y borrar notas según sea necesario../  Autenticación de Usuarios: Para garantizar la privacidad y seguridad de la información, la Journal App puede incluir funciones de autenticación de usuarios mediante Firebase Authentication, restringiendo el acceso a las notas personales../  Diseño Responsivo: La aplicación se diseñará para ser responsiva, permitiendo a los usuarios acceder y utilizar la Journal App desde una variedad de dispositivos, como computadoras de escritorio, tabletas y teléfonos móviles.",

  "overview-udemy-description":"Udemy Clone es un proyecto de práctica en el cual he creado una página inspirada en la landing page de Udemy, una plataforma educativa en línea. El objetivo principal de este proyecto es mejorar mis habilidades en la creación de layouts, diseño web y maquetación, tomando como referencia un sitio web existente.",
  "overview-udemy-features":"Diseño Similar a Udemy:La página replica la estructura y el diseño visual de la landing page de Udemy, incorporando elementos como secciones de categorías, destacados y testimonios para recrear la experiencia del usuario../Diseño Responsivo:Se ha implementado un diseño responsivo para garantizar que la página sea accesible y funcional en diferentes dispositivos, desde computadoras de escritorio hasta dispositivos móviles../Colores y Elementos Visuales:Se han utilizado colores y elementos visuales similares a los de Udemy para lograr coherencia con la marca y ofrecer una experiencia visual familiar a los usuarios.",

  "overview-crunchyroll-description":"Crunchyroll Clone es un proyecto en el cual estoy replicando el diseño de la página de Crunchyroll, una popular plataforma de streaming de anime. Para lograr esto, estoy utilizando la API Jikan para obtener información sobre animes y Markdown (con MDX) para gestionar la sección de noticias",
  "overview-crunchyroll-features":"Replicación del Diseño de Crunchyroll:La aplicación imitará la apariencia y la estructura visual de la página de Crunchyroll para brindar una experiencia familiar a los usuarios../Integración de la API Jikan:Utilizo la API Jikan para obtener datos sobre animes, lo que permite mostrar una lista de animes, información detallada y también seleccionar un anime al azar../Búsqueda de Animes:Implemento un buscador que permite a los usuarios buscar animes específicos, facilitando la exploración y selección de contenido../Anime Aleatorio:Incorporo la funcionalidad de mostrar un anime aleatorio, proporcionando a los usuarios la opción de descubrir nuevos títulos de manera aleatoria../Sección de Noticias con Markdown (MDX):La sección de noticias utiliza Markdown (con MDX) para presentar información de manera formateada y estilizada.",

  "overview-disney-description":"El Disney Clone es un proyecto donde estoy utilizando GraphCMS para gestionar la información de las películas, replicando la apariencia de la plataforma de Disney. Este proyecto incorpora funcionalidades clave como una lista de películas, un buscador, detalles de la película y la posibilidad de ver el tráiler asociado.",
  "overview-disney-features":"Integración con GraphCMS:Utilizo GraphCMS para crear y gestionar la información relacionada con las películas, incluyendo detalles como títulos, descripciones y enlaces a tráilers../Lista de Películas:La aplicación muestra una lista de películas disponibles, permitiendo a los usuarios explorar y seleccionar títulos de manera eficiente../Búsqueda de Películas:Implemento un buscador que permite a los usuarios buscar películas específicas, facilitando la búsqueda y selección de contenido../Detalle de la Película:Cuando los usuarios seleccionan una película, la aplicación muestra detalles detallados, como sinopsis, clasificación, y cualquier información adicional relevante../Visualización del Tráiler:Proporciono la capacidad de ver el tráiler de la película directamente desde la aplicación, mejorando la experiencia del usuario y ofreciendo una vista previa multimedia.",

  "overview-netflix-description":"Netflix Clone es un proyecto donde estoy utilizando la API de TMDB (The Movie Database) para crear una aplicación que imita la apariencia de Netflix. Este proyecto incluye funcionalidades clave como la visualización de películas por categorías, un buscador y ver el detalle de cada película.",
  "overview-netflix-features":"Integración con la API de TMDB:Utilizo la API de TMDB para obtener información sobre películas, incluyendo detalles como títulos, descripciones, imágenes y categorías../Películas por Categorías:La aplicación organiza las películas por categorías, permitiendo a los usuarios explorar y seleccionar contenido específico basado en géneros o temas../Búsqueda de Películas:Implemento un buscador que permite a los usuarios buscar películas por título, facilitando la búsqueda y selección de contenido de manera rápida../Descripción de la Película:Cuando los usuarios seleccionan una película, la aplicación muestra una descripción detallada que incluye sinopsis, clasificación, reparto, y cualquier otra información relevante.",

  "overview-planet-description":"EarthJS Planet es un proyecto en el que estoy utilizando Three.js para incorporar una esfera con textura de la Tierra, creando así una representación tridimensional del planeta. Este proyecto incluye la funcionalidad de colocar coordenadas para crear puntos específicos en la superficie terrestre.",
  "overview-planet-features":"Representación Tridimensional de la Tierra:Utilizo Three.js para renderizar una esfera con textura de la Tierra, proporcionando una visualización tridimensional realista del planeta../Incorporación de Coordenadas:Implemento la funcionalidad que permite a los usuarios introducir coordenadas geográficas (latitud y longitud) para colocar puntos específicos en la superficie terrestre../Puntos en la Superficie Terrestre:Cada vez que los usuarios ingresan coordenadas, la aplicación coloca un punto en la esfera que representa la ubicación correspondiente en la Tierra../Interactividad:Ofrezco una experiencia interactiva que permite a los usuarios explorar la esfera, colocar varios puntos y ver cómo estos se distribuyen sobre la superficie del planeta.",

  "overview-dashboard-description":"Dashboard App es una aplicación de panel de control donde estoy utilizando Recharts y React Table para crear múltiples tablas y gráficos. Esta aplicación incluye funcionalidades clave como la capacidad de insertar y modificar tablas, interactuar con los gráficos generados, y un modo oscuro para una experiencia visual variada.",
  "overview-dashboard-features":"Utilización de Recharts y React Table:Implemento Recharts para la creación de gráficos y React Table para la gestión de tablas, permitiendo una integración eficiente de datos visuales y tabulares../Tablas Dinámicas:Ofrezco la funcionalidad de insertar y modificar tablas, permitiendo a los usuarios personalizar y organizar la información según sus necesidades../Gráficos Interactivos:Los gráficos generados con Recharts son interactivos, permitiendo a los usuarios explorar datos específicos y obtener detalles adicionales al interactuar con los elementos del gráfico../Modo Oscuro:Incluyo un modo oscuro que los usuarios pueden activar para cambiar la apariencia visual de la aplicación, proporcionando una opción estética adicional../Gestión de Estado Reactiva:Utilizo un estado reactivo para garantizar que cualquier cambio en las tablas o gráficos se refleje de inmediato en la interfaz de usuario.",

  "overview-ecommerce-description":"Ecommerce App es una página de comercio electrónico construida utilizando la pila MERN (MongoDB, Express.js, React, Node.js), e integrando el SDK de MercadoPago. Esta aplicación abarca una variedad de funcionalidades esenciales para una experiencia de compra en línea, como la creación de usuario, visualización de productos por categoría y filtración, vista detallada de productos, gestión de carrito y favoritos, pagos de prueba con MercadoPago y un historial de compras.",
  "overview-ecommerce-features":"Stack MERN:Utilizo MongoDB para la base de datos, Express.js para el backend, React para el frontend, y Node.js para el servidor../Autenticación de Usuario:Implemento la creación de usuarios para permitir el acceso personalizado y la gestión de historiales de compras../Visualización de Productos:Los usuarios pueden ver todos los productos disponibles, filtrar por categoría, y explorar las opciones de compra../Carrito y Favoritos:Incluyo la funcionalidad de agregar productos al carrito y a la lista de favoritos, proporcionando una experiencia de compra personalizada../Integración con MercadoPago:Utilizo el SDK de MercadoPago para facilitar pagos seguros y eficientes, permitiendo a los usuarios realizar pagos de prueba../Historial de Compras:Los usuarios pueden revisar su historial de compras, incluyendo detalles de productos comprados, fechas y estados de transacción.",

  "overview-twitter-description":"Twitter App es una aplicación social construida con la pila MERN (MongoDB, Express.js, React, Node.js) que permite realizar operaciones CRUD (Crear, Leer, Actualizar, Borrar). Esta aplicación incorpora funcionalidades clave de una red social, como la creación de usuarios, publicación de tweets, carga de imágenes mediante Cloudinary, interacción con publicaciones mediante likes y respuestas, y una sección de Tendencias (TTs).",
  "overview-twitter-features":"Stack MERN:Utilizo MongoDB para la base de datos, Express.js para el backend, React para el frontend, y Node.js para el servidor../Autenticación de Usuario:Implemento la creación de usuarios para personalizar la experiencia y permitir interacciones sociales../Creación de Tweets:Los usuarios pueden crear publicaciones de texto, que pueden incluir también imágenes subidas mediante Cloudinary../Carga de Imágenes con Cloudinary:Utilizo Cloudinary para permitir a los usuarios cargar imágenes y asociarlas a sus tweets../Interacción Social:Incluyo la funcionalidad de dar Me Gusta a tweets y responder a publicaciones, fomentando la interacción entre usuarios../Sección de Tendencias (TTs):Muestro una sección de tendencias que refleja los temas más populares y discutidos en la plataforma.",

  "overview-discord-description":"Discord App es un proyecto de practica donde estoy replicando la landing page de Discord, una popular plataforma de comunicación en línea. La landing page incluye tanto la vista principal como la vista específica de la aplicación Discord.",
  "overview-discord-features":"Interfaz Inspirada en Discord:La landing page está diseñada para replicar la estética y el estilo visual característicos de la aplicación Discord, proporcionando a los visitantes una experiencia familiar../Sección de Presentación:La página principal presenta una visión general del proyecto Discord Clone, destacando sus características y funcionalidades clave../Vista de la Aplicación:Incluyo una sección específica que simula la interfaz de la aplicación Discord, permitiendo a los visitantes visualizar cómo se vería y sentiría la aplicación../Elementos Interactivos:Agrego elementos interactivos, como botones y enlaces, para proporcionar una experiencia de usuario más dinámica y permitir que los visitantes exploren diferentes secciones de la landing page.",

  "overview-sports-description":"Sports App es una aplicación de información sobre fútbol centrada en las 5 principales ligas, donde toda la información es obtenida mediante técnicas de scrapping de la web Transfermarkt. Además, incluye dos minijuegos, Higher or Lower y World Cup 2022 Prediction. Las funcionalidades clave se centran en proporcionar estadísticas detalladas de la liga, incluyendo calendarios y posiciones, así como información específica de los clubes, jugadores y partidos.",
  "overview-sports-features":"Scrapping de Transfermarkt:La aplicación utiliza técnicas de scrapping para obtener datos en tiempo real de Transfermarkt, asegurando que la información sea siempre actualizada y precisa../Estadísticas de las 5 Principales Ligas:Proporciona estadísticas detalladas, calendarios y posiciones de las 5 principales ligas de fútbol, ofreciendo a los usuarios una visión completa del rendimiento de los equipos../Información de los Clubes:Ofrece estadísticas detalladas de cada club, incluyendo posiciones en la liga, calendario de partidos y lista de jugadores../Calendario y Posiciones:Permite a los usuarios acceder al calendario completo de la liga y ver las posiciones actualizadas en tiempo real../Minijuegos Interactivos:Incluye dos minijuegos, Higher or Lower y World Cup 2022 Prediction, para agregar una capa de entretenimiento y participación de los usuarios.",

  "overview-whatsapp-description":"WhatsApp Clone es una aplicación de mensajería en tiempo real que utiliza GraphQL Subscriptions para facilitar la comunicación instantánea. La aplicación incluye funciones esenciales de mensajería, creación de usuarios, creación de grupos, personalización de perfiles y grupos, así como la capacidad de enviar GIFs.",
  "overview-whatsapp-features":"GraphQL Subscriptions:Utilizo GraphQL Subscriptions para permitir la comunicación en tiempo real, asegurando que los mensajes y actualizaciones se entreguen de manera instantánea../Creación de Usuarios:Los usuarios pueden registrarse y crear perfiles personalizados, incluyendo la posibilidad de establecer su nombre de usuario y agregar una imagen de perfil../Creación de Grupos:Permite a los usuarios crear grupos de chat, agregando miembros y estableciendo configuraciones específicas del grupo../Personalización de Perfiles y Grupos:Ofrece la opción de cambiar el nombre y la imagen de fondo del usuario, así como la capacidad de personalizar la información del grupo../Permisos de Administrador en Grupos:Permite otorgar permisos de administrador a usuarios específicos dentro de un grupo, brindando mayor control sobre la gestión del grupo../Envío de GIFs:Incorpora la capacidad de enviar GIFs en los mensajes, ampliando las opciones de expresión y comunicación visual."
}
